{
    "main": {
        "item": [
            {
                "id": 0,
                "name": "xxxx",
                "description": "xxxx",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "xxxx"
            },
            {
                "id": 1,
                "name": "Create",
                "description": "Create предлагает множество инструментов и блоков для создания и декорации построек, а так же автоматизации. Новые элементы дадут игроку на выбор больше вариантов дизайна, обработка предметов будет происходить не в одном блоке, для этого потребуется много \"акторов\", работающих вместе.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/102865-create_.html"
            },
            {
                "id": 2,
                "name": "Create Crafts & Additions",
                "description": "Create Crafts & Additions - это дополнение к моду Create, которое введет возможность совмещать энергию из ванильного Minecraft и мода Create. Что даст вам ещё больше возможностей взаимодействия с механизмами Create!",
                "dependence": {
                    "libs_id": false,
                    "mod_id": 1
                },
                "link": "https://minecraft-inside.ru/mods/152858-create-crafts-additions.html"
            },
            {
                "id": 3,
                "name": "Create Confectionery",
                "description": "Create Confectionery - дополнение к моду Create, которое введет возможность создания шоколада и разных сладких изделий. Все это вы сможете создавать с помощью механизмов из мода Create!",
                "dependence": {
                    "libs_id": false,
                    "mod_id": 1
                },
                "link": "https://minecraft-inside.ru/mods/152856-create-confectionery.html"
            },
            {
                "id": 4,
                "name": "Create: Steam Powered",
                "description": "Create: Steam Powered - это дополнение к моду Create, которое создано, чтобы добавить возможность выработке FE энергии из пара. Чтобы начать её вырабатывать, у вас будет возможность создать паровые двигатели, большие шестерни, маховики и много другое.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": 1
                },
                "link": "https://minecraft-inside.ru/mods/152857-create-steam-powered.html"
            },
            {
                "id": 5,
                "name": "Create: Stuff Additions",
                "description": "Аддон для мода Create. Он добавит снаряжение из новых материалов, среди которых будет три сета инструментов, портативную дрель, реактивный ранец (джетпак) позволяющий летать и латунный экзоскелет увеличивающий вашу силу, но при этом расходующий индикатор голода.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": 1
                },
                "link": "https://minecraft-inside.ru/mods/145471-create-stuff-additions.html"
            },
            {
                "id": 6,
                "name": "Create Plus",
                "description": "Мод добавляет шлемы с функцией Create Mod Goggle и ванильными параметрами брони. Это полезно, если вы хотите носить полную алмазную броню, но также хотите видеть статистику очков.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": 1
                },
                "link": "https://www.kingminecraftmods.net/create-plus-mod/"
            },
            {
                "id": 7,
                "name": "More Create Stuffs",
                "description": "Аддон для Create, который введет интеграцию с целым рядом других модов. Например, вы сможете обрабатывать руду create с помощью предметов из других модов. Это позволит совместить механики и организовать комфортную лично для вас игру.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": 1
                },
                "link": "https://minecraft-inside.ru/mods/145566-more-create-stuffs.html"
            },
            {
                "id": 8,
                "name": "Create Deco",
                "description": "Create Deco - дополнение для мода Create, которое введет в игру множество новых декоративных блоков и предметов. Все они будут сделаны в стиле основного мода, но сильно не отличающихся от ванильных.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": 1
                },
                "link": "https://minecraft-inside.ru/mods/152859-create-deco.html"
            },
            {
                "id": 9,
                "name": "Create Gears",
                "description": "Небольшой аддон для Create, который добавит шестерни, механические переключатели передач, а также цепные приводы в закрытом корпусе.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": 1
                },
                "link": "https://minecraft-inside.ru/mods/148145-create-gears.html"
            },
            {
                "id": 10,
                "name": "Immersive Engineering",
                "description": "Качественный индустриальный мод, основанный на реалистичных инструментах и машинах. Вместо светящейся красной пыли он предлагает использовать провода; вместо одного блока, который магически превращает руду в пыль, этот мод предлагает мультиблоковую (5x3x3) дробилку. Кроме того, мод обладает красивыми текстурами, добавляющими в игру шарм ретро-футуризма.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/27783-immersive-engineering.html"
            },
            {
                "id": 11,
                "name": "Immersive Petroleum",
                "description": "Аддон для популярного индустриального мода Immersive Engineering, с которым в майнкрафт появятся механизмы для добычи, обработки и использования нефти.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": 10
                },
                "link": "https://minecraft-inside.ru/mods/54206-immersive-petroleum.html"
            },
            {
                "id": 12,
                "name": "Engineer's Decor",
                "description": "Маленькое декоративное дополнение для мода Immersive Engineering, которое добавит игру несколько блоков, которые помогут улучшить вид построек основного мода и придать им технологический шарм.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": 10
                },
                "link": "https://minecraft-inside.ru/mods/89083-engineers-decor.html"
            },
            {
                "id": 13,
                "name": "Immersive Posts",
                "description": "Мод Immersive Posts - дополнение которое добавляет более высокие опоры для линий передач мода Immersive Engineering, что позволит строить более реалистичные и удобные ЛЭП в вашем мире.С данным модом вы сможете построить ЛЭП любой высоты, ограничений нет, теперь провода не будут висеть слишком низко и мешать вашему обзору.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": 10
                },
                "link": "https://ru-minecraft.ru/mody-minecraft/58047-immersive-posts.html"
            },
            {
                "id": 14,
                "name": "Immersive Armors",
                "description": "В вашем распоряжении будут доступны уникальные комплекты брони в около ванильной стилистике. Мод не станет добавлять скучную перерисованную броню, а сделает каждый набор особенным, имеющим не только оригинальный внешний вид, но и особенные эффекты, вроде отталкивания, шипов или даже режима берсерка.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/155994-immersive-armors.html"
            },
            {
                "id": 15,
                "name": "MrCrayfish’s Furniture",
                "description": "Популярный мод на мебель в майнкрафт, который добавит большое количество разнообразной фурнитуры, например, появится: стол, стулья, диван, кресла, телевизор, компьютер и другие предметы.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/9764-mrcrayfishs-furniture-mod.html"
            },
            {
                "id": 16,
                "name": "Dynamic Surroundings",
                "description": "Данный мод значительно переработает визуальную и звуковую составляющую, тем самым сделав майнкрафт реалистичнее, при этом не изменив игровую механику. Будут усовершенствованы осадки, переработан блок лавы, а в биомах появятся различные природные звуки.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/29323-dynamic-surroundings.html"
            },
            {
                "id": 17,
                "name": "AmbientSounds",
                "description": "Удивительный мод, который введет в игру огромное количество природных звуков. Оценить новое звучание вы сможете не только в биомах, но и в пещерах, под водой, в аду и крае.",
                "dependence": {
                    "libs_id": 2,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/43934-ambientsounds.html"
            },
            {
                "id": 18,
                "name": "MineColonies",
                "description": "Установив этот мод вы сможете основать свой собственный небольшой город, населенный жителями. В игре появятся блоки для быстрой постройки домов и множество мобов с самыми разными профессиями, от строителей и фермеров до охранников и алхимиков.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/9683-minecolonies-mod.html"
            },
            {
                "id": 19,
                "name": "Mowzie’s Mobs",
                "description": "Mowzie’s Mobs добавит в ваш игровой мир атмосферных мобов, обладающих  уникальными трехмерными моделями, звуками и измененным поведением. В данный момент доступно восемь видов мобов.",
                "dependence": {
                    "libs_id": 3,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/12821-mowzies-mobs.html"
            },
            {
                "id": 20,
                "name": "GraveStone",
                "description": "Теперь на месте смерти героя будут появляться могилы с головой и датой смерти, они будут хранить внутри себя весь утерянный инвентарь.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/25055-gravestone.html"
            },
            {
                "id": 21,
                "name": "Travel Anchors",
                "description": "Данный мод выносит якорь путешествий из EnderIO в отдельную модификацию. Посох путешествий позволит игроку перемещаться на короткие расстояния, а к якорю путешествий вы сможете телепортироваться на любом расстоянии, а также видеть его через стены с помощью посоха.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/153381-travel-anchors.html"
            },
            {
                "id": 22,
                "name": "Chunk Animator",
                "description": "Небольшой мод, который изменит анимацию появления чанков. Отныне они будут не резко появляться, а плавно вырастать из земли.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/21235-chunk-animator.html"
            },
            {
                "id": 23,
                "name": "Daleeny's MoreFoods",
                "description": "Модификация поможет разнообразить ваш привычный рацион новыми видами блюд. Сохраняя ванильную стилистику, она добавит варёные яйца, сыр, зелёный лук, тушёный бабук и ещё некоторые другие рецепты, идеально вписывающиеся в игру.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/153211-daleenys-morefoods.html"
            },
            {
                "id": 24,
                "name": "Carry On",
                "description": "Интересная модификация, которая позволит игроку переносить блоки с интерфейсом (печь, сундук, механизмы). Для этого достаточно зажать Shift и нажать правой кнопкой мыши по объекту с пустыми руками. В новых версиях мода, можно переносить не только блоки, но и животных.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/57857-carry-on.html"
            },
            {
                "id": 25,
                "name": "Antique Atlas",
                "description": "Мод добавит в игру античный атлас - книгу с картой в старинном стиле, на которой можно посмотреть все посещенные места и использовать маркеры, для сохранения особо важных точек. Чтобы перемещаться по карте используйте стрелки на клавиатуре, а для изменения масштаба мышку или клавиши +/-.",
                "dependence": {
                    "libs_id": 4,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/8914-antique-atlas-mod.html"
            },
            {
                "id": 26,
                "name": "Morphing",
                "description": "Теперь после убийства моба можно замаскироваться под него, и что немало важно, между коллекцией масок можно переключаться (для переключения используй клавиши Х и Ъ).",
                "dependence": {
                    "libs_id": 5,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/8923-morphing-mod.html"
            },
            {
                "id": 27,
                "name": "Macaw's Windows",
                "description": "С Macaw's Windows в вашем майнкрафт появится 48 видов окон, которые будут отличаться между собой дизайном и размерами. В отличии от блоков стекла они будут выглядеть эстетичнее и к тому же их можно открывать.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/124689-macaws-windows.html"
            },
            {
                "id": 28,
                "name": "AppleSkin",
                "description": "Модификация добавит вырезанные из AppleCore твики, которые покажут насколько насытит вас та или иная еда и визуализируют насыщение в интерфейсе голода.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/55336-appleskin.html"
            },
            {
                "id": 29,
                "name": "Applied Energistics 2",
                "description": "AE2 - обширный технический мод, который добавляет блоки и механизмы для получения и использования энергии. Большая часть функций этого мода сосредоточена на основной механике - материальной энергии (МЭ)",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/11203-applied-energistics-2-mod.html"
            },
            {
                "id": 30,
                "name": "Cooking for Blockheads",
                "description": "Модификация добавит в игру крафт книги рецептов, с помощью которой вы сможете узнать, какую еду вы сможете приготовить из ресурсов вашего инвентаря.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/16008-cooking-for-blockheads.html"
            },
            {
                "id": 31,
                "name": "Mutant More",
                "description": "В майнкрафт появятся мобы-мутанты! Этих мобов можно как просто встретить в мире, так и создать с помощью специальных зелий-мутагенов. Мутанты невероятно сильные противники и битва с ними станет для вас настоящим испытанием, а победа принесет награду в виде ценного лута. \n Также в игру добавится много новых достижений, которые можно будет получить сражаясь с монстрами и не только.",
                "dependence": {
                    "libs_id": 3,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/151460-mutant-more.html"
            },
            {
                "id": 32,
                "name": "Epic Figh",
                "description": "Мод изменит анимации боя, добавляя обычную атаку, с рывком, кувырок и особую атаку в зависимости от типа оружия. Также у предметов появятся новые характеристики, а вес брони будет сказываться на скорости удара и оглушении при принятии вами удара.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/138920-epic-fight.html"
            },
            {
                "id": 33,
                "name": "Shoulder Surfing Reloaded",
                "description": "Shoulder Surfing изменит вид от третьего лица (F5), теперь вы будете смотреть через плечо вашего игрового героя. Положение камеры можно будет менять используя горячие клавиши.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/36330-shoulder-surfing-reloaded.html"
            },
            {
                "id": 34,
                "name": "Alex's Mobs",
                "description": "Мод добавит в игру более сорока новых мобов, которые будут обладать уникальными механиками, способностями и дропами. Всех новых существ можно разделить на две категории: существующие в реальном мире и вымышленные. Автор модификации старается сделать мобов похожими на ванильные варианты, чтобы они не выделялись и не противоречили существующему миру игры.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/141632-alexs-mobs.html"
            },
            {
                "id": 35,
                "name": "YDM's Weapon Master",
                "description": "Простая косметическая модификация, с которой на модели вашего игрока будут отображаться инструменты из хотбара. Вы сможете легко настроить отображение определённых слотов с помощью графического интерфейса, а также в отдельности щита.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/156283-ydms-weapon-master.html"
            },
            {
                "id": 35,
                "name": "Sophisticated Backpacks",
                "description": "В майнкрафт появятся рюкзаки, которые вы сможете размещать в мире, раскрашивать в разные цветовые комбинации, а также дополнять различными улучшениями.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/141265-sophisticated-backpacks.html"
            },
            {
                "id": 36,
                "name": "Better Builder's Wands",
                "description": "В игре появится четыре вида специальных палочек, которые в разной степени упростят процесс строительства и дадут вам возможность в короткие сроки сооружать огромные постройки.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/24728-better-builders-wands.html"
            },
            {
                "id": 37,
                "name": "Macaw's Paintings",
                "description": "Модификация на картины от популярного пользователя Macaw, известного своими красивыми декоративными модами. С Paintings в майнкрафт появится тридцать три новых картины стандартных форм и размеров, они помогут украсить постройки и дополнить декор вашей карты.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/152575-macaws-paintings.html"
            },
            {
                "id": 38,
                "name": "Sword Variations",
                "description": "Хотите увидеть в игре больше вариантов ванильного оружия? Sword Variations добавит в игру семь новых видов оружия, каждое со своими особыми сильными и слабыми сторонами, подходящими под разные стили игры. Кроме оружия, в игре также появится особые зачарования для нового оружия, соответствующие их стилю боя.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/152976-sword-variations.html"
            },
            {
                "id": 39,
                "name": "Farming for Blockheads",
                "description": "Теперь вы сможете покупать семена и саженцы в майнкрафт, для этих целей появится специальный торговый блок,  который добавит этот мод. Модификация совместима с Harvestcraft и позволяет изменять/добавлять сделки используя файл конфигурации.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/48714-farming-for-blockheads.html"
            },
            {
                "id": 40,
                "name": "Relics",
                "description": "Мод от русскоязычного автора, благодаря ему в майнкрафт появятся реликвии с уникальными полезными механиками, которые пригодятся вам как во время битвы с ордами монстров, так и во время мирной жизни фермера или шахтера. Каждая реликвия генерируется в определенном, подходящем для неё данже (в пирамиде, заброшенной шахте, доме охотника или фермера).",
                "dependence": {
                    "libs_id": 6,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/143546-relics.html"
            },
            {
                "id": 41,
                "name": "Carpet Everything!",
                "description": "Простой декоративный мод, с которым можно будет размещать ковры на лестницах и люках, в том числе добавленных из модов. Такая небольшая механика откроет новые возможности для декорирования построек как внутри, так и снаружи.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/153059-carpet-everything.html"
            },
            {
                "id": 42,
                "name": "Capybara",
                "description": "После установки модификации в майнкрафт появится Капибара из Unnamed Animal. Это милое существо будет иногда появляться в джунглях. Приручить его можно с помощью арбуза, сахарного тростника или яблок, после чего ваш новый питомец сможет носить на себе сундуки подобно ламам или садиться по нажатию по нему палкой.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/154010-capybara.html"
            },
            {
                "id": 43,
                "name": "Water Source",
                "description": "Water Source введет механизм жажды, которую нужно утолять с помощью воды или содержащих ее продуктов. Вы сможете очищать воду с помощью специальных блоков, пить кокосовую воду и получать жидкость, поглощая фрукты.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/141968-water-source.html"
            },
            {
                "id": 44,
                "name": "Farmer's Delight",
                "description": "Farmer's Delight создан для улучшения механик приготовления пищи и расширения фермерства в майнкрафт. Его цель добавит небольшое количество нового контента и расширить взаимодействие игрока с уже существующими предметами и блоками.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/137734-farmers-delight.html"
            },
            {
                "id": 45,
                "name": "Caves & Cliffs Backport",
                "description": "Модификация добавит большинство нововведений из обновления Caves & Cliffs в старые версии игры. После установки, вы будете встречать в мире новые блоки, предметы, мобов, механики и конечно же новые подземные биомы.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/143850-caves-cliffs-backport.html"
            },
            {
                "id": 46,
                "name": "GrowthCraft",
                "description": "Неплохой мод, направленый на улучшение фермерства в Minecraft, с ним в игре появятся новые виды культур, вы сможете готовить йогурт, сыр, вино, собирать мёд и ловить рыбу сетями.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/9114-growthcraft-mods.html"
            },
            {
                "id": 47,
                "name": "Subterranean Wilderness",
                "description": "Обширная модификация, которая добавит множество подземных биомов, они украсят невзрачные игровые пещеры, и сделают из них по-настоящему живые и захватывающие локации.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/140097-subterranean-wilderness.html"
            },
            {
                "id": 48,
                "name": "Farmer's Respite",
                "description": "Благодаря этому аддону к Farmer's Delight, в майнкрафт появится чай и механика его заваривания! Красивый медный чайник станет отличным дополнением к игре, привнося в неё уют, горячий чай и умиротворение.",
                "dependence": {
                    "libs_id": 7,
                    "mod_id": 44
                },
                "link": "https://minecraft-inside.ru/mods/152576-farmers-respite.html"
            },
            {
                "id": 49,
                "name": "Aquamirae",
                "description": "Модификация посвященная застывшему бескрайнему океану, таящему в своих недрах как опасности, так и богатства. После установки мода, появится новый биом и его обитатели, различные структуры, новая броня и оружие.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/151115-aquamirae.html"
            },
            {
                "id": 50,
                "name": "Treasure2!",
                "description": "После установки мода в мире начнут генерироваться сундуки с сокровищами, но придется постараться не только найти сундук но и открыть, ведь сундук будет закрыт на замок, а может и даже несколько, и к каждому вам придется найти ключ. Иногда в таких сундуках могут попадаться серебряные и золотые монеты, их вы можете бросить в колодец желаний и получить случайное \"сокровище\".",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/79364-treasure2.html"
            },
            {
                "id": 51,
                "name": "Copper Golem Mob",
                "description": "CGM вводит в майнкрафт медного голема, показанного на голосовании в 2021 году, но так и не набравшего голосов, чтобы появиться в игре. Голем будет подвержен окислению и со временем превратиться в статую. Соскоблить с него ржавчину можно будет топором или ударом молнии.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/151519-copper-golem-mob.html"
            },
            {
                "id": 52,
                "name": "Expanded Caves",
                "description": "Модификация добавляет в майнкрафт ряд декоративных блоков, призванных разнообразить игровые пещеры. Спускаясь под землю вы сможет увидеть небольшие камешки, растения, сталактиты, сталагмиты и даже небольшие структуры, которые делают пещеры вариативнее и интереснее.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/155259-expanded-caves.html"
            },
            {
                "id": 53,
                "name": "Foliet's Loot Bag",
                "description": "RPG мод, с которым после убийства моба с 4% шансом может выпасть мешочек с разнообразными полезными ресурсами, от брони и инструментов, до еды и руды. Шанс выпадения и количество лута можно изменить в файл конфигурации модификации.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/151197-foliets-loot-bag.html"
            },
            {
                "id": 54,
                "name": "Dungeons Enhanced",
                "description": "Вы устали из раза в раз посещать приевшиеся ванильные структуры? Теперь в майнкрафт появится четыре вариации оригинальных структур и семнадцать новых данжей, которые будут появляться почти во всех игровых биомах. От ледяных подземелий и величественных замков, до лабиринтов с монстрами и небольших шахтёрских домиков.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/151438-dungeons-enhanced.html"
            },
            {
                "id": 55,
                "name": "Rare Ice",
                "description": "С данным модом появится вероятность генерации льда с заключенными внутри него предметами разного вида. Теперь исследование зимних биомов станет увлекательным и полезным занятием!",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/130884-rare-ice.html"
            },
            {
                "id": 56,
                "name": "Nature's Compass",
                "description": "Модификация добавит в игру природный компас, который поможет вам найти определенный биом и покажет вам информацию о нем.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/42394-natures-compass.html"
            },
            {
                "id": 57,
                "name": "Macaw's Fences and Walls",
                "description": "Мод продолжает серию декоративных модификаций от автора Macaw, в этот раз автор подумал над тем, как можно разнообразить заборы в игре. С ним в майкнрафт появятся новые версии заборов, стен и ворот, конечно же всё это в красивой ванильной стилистике.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/144422-macaws-fences-and-walls.html"
            },
            {
                "id": 58,
                "name": "Bindersnatch",
                "description": "В мире появятся необычные и очаровательные существа — Помпоны. Эти зверьки смогут приносить вам пользу, ведь собранный с них с помощью специального блока материал, позволит создать мечи с уникальными способностями или изготовить сгустки слизи. \n Чтобы вырастить своего первого помпона вам потребуется найти яйцо в дубовых или березовых лесах. После чего необходимо обзавестись гнездом и нагревателем (использующим редстоун), который согреет яйцо ночью. После вылупления, вы можете начать получения материала, разместив рядом с мобом сборщик и кормушку с яблоками.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/154592-bindersnatch.html"
            },
            {
                "id": 59,
                "name": "Sharks",
                "description": "Sharks добавит в игру нейтральные и враждебные варианты акул, которые разнообразят морские просторы майнкрафт. Вы сможете собирать зубы этого моба, чтобы сделать себе ожерелье для усиления атаки.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/145700-sharks.html"
            },
            {
                "id": 60,
                "name": "Jumреrs",
                "description": "Jumреrs генерирует небольшие ловушки, которые будут появляться в темных местах. Случайно наступив на такую ловушку, ничего не подозревающий игрок заспавнит перед собой монстра (зомби, скелета или паука). Поэтому теперь надо быть осторожней и смотреть под ноги, чтобы встреча с ловушкой не оказалась для вас печальным событием.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/154814-jumреrs.html"
            },
            {
                "id": 61,
                "name": "Storage Drawers",
                "description": "Мод добавит в майнкрафт новые виды ящиков для хранения стеков, в них нету привычного инвентаря, чтобы положить предметы - возьми их в руку и нажми на блок правой кнопкой мыши, чтобы взять - нажми на блок левой кнопкой мыши.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/10446-storage-drawers-mod.html"
            },
            {
                "id": 62,
                "name": "VanillaFoodPantry",
                "description": "Большой кулинарный мод, который добавит огромное количество самых разных блюд, а также способов применения не только новых, но и ванильных продуктов.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/124514-vanillafoodpantry.html"
            },
            {
                "id": 63,
                "name": "Faz's Medieval Gear",
                "description": "Мод на средневековую тематику, после установки которого в майнкрафт появится броня и оружие данной эпохи. Все новые доспехи будут иметь красивые трёхмерные модели, отлично подходящие как для ролевой игры, так и просто для выживания.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/155878-fazs-medieval-gear.html"
            },
            {
                "id": 64,
                "name": "GokiStats",
                "description": "Порт довольно известной модификации, благодаря которой у игрока появится набор полезных навыков, как в RPG играх. Навыки многоуровневые и их можно прокачивать за счет полученного опыта.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/74528-gokistats.html"
            },
            {
                "id": 65,
                "name": "Mimic",
                "description": "Модификация была сделана для усложнения ванильных структур, чтобы их исследования были для вас неожиданным и захватывающим событием. В майнкрафт появятся новые мобы - мимики, с виду они похожи на обычные сундуки, но при приближении игрока эти мобы оживут и нападут на него, огрызаясь своей большой пастью.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/146123-mimic.html"
            },
            {
                "id": 66,
                "name": "Steel&Gore",
                "description": "Steel&Gore направленн на улучшение исследования мира, путём добавления новых данжей. Кроме красивого внешнего и внутреннего вида, данжи будут наполнены большим количеством как ванильного, так и совершенно нового лута, от мечей, до различных посохов.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/156182-steelgore.html"
            },
            {
                "id": 67,
                "name": "The Endergetic Expansion",
                "description": "Цель данного мода улучшить Край и все что с ним связано. На данный момент разработки, авторы предлагаются нам прогуляться по новому биому с уникальнми эффектами и механикой, его можно отыскать на дальних островах Края.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/112457-the-endergetic-expansion.html"
            },
            {
                "id": 68,
                "name": "Living Chest",
                "description": "Автор мода предлагает вам завести нового питомца Честера из Don't Starve Together! Этот милый живой сундучок будет призываться с помощью специального посоха и станет необычным способом хранения ваших вещей.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/154746-living-chest.html"
            },
            {
                "id": 69,
                "name": "Armored Mobs",
                "description": "Твик сделает так, что у мобов-нежити будет повышенный шанс появиться в броне. А тип брони будет зависеть от сложности игры, к примеру, на обычной и повышенной сложности броня на мобах даже будет зачарованной.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/156425-armored-mobs.html"
            },
            {
                "id": 70,
                "name": "Greek Fantasy",
                "description": "Вы когда-нибудь задумывались, каким будет Minecraft с циклопами, сатирами и кентаврами? Или гиганты, герионы и горгоны? А как насчет сирен и единорогов? Больше не удивляйтесь - в этом моде есть все!",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/141905-greek-fantasy.html"
            },
            {
                "id": 71,
                "name": "Malum",
                "description": "Malum магический мод посвященный темной магии, а конкретнее взаимодействию с душами и духами мобов, при помощи которых вы сможете проводить таинственные ритуалы.",
                "dependence": {
                    "libs_id": 6,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/146872-malum.html"
            },
            {
                "id": 72,
                "name": "Tomes",
                "description": "Вы когда-нибудь хотели читать заклинания как настоящий маг в Minecraft? Теперь вы можете! Tomes, добавит три волшебных книги, их можно зачаровать на столе зачарований и получить редкие и интересные заклинания, которые будут действовать пока вы держите книгу. Только чары тридцатого уровня могут применять активные заклинания, так что для их получения вам потребуется запастись большим количеством книжных полок.",
                "dependence": {
                    "libs_id": false,
                    "mod_id": false
                },
                "link": "https://minecraft-inside.ru/mods/150931-tomes.html"
            }
        ],
        "lib": [
            {
                "id": 0,
                "name": "xxxx",
                "description": "xxxx",
                "link": "xxxx"
            },
            {
                "id": 1,
                "name": "Configured",
                "description": "Простой и весьма удобный мод, который позволит менять конфигурацию модов прямо в меню forge, благодаря чему для изменения конфиг-файла мода вам не потребуется каждый раз перезапускать майнкрафт. Вы сможете изменять клиентскую, общую и серверную конфигурацию для любых модов, как это было в старых версиях forge.",
                "link": "https://minecraft-inside.ru/mods/154790-configured.html"
            },
            {
                "id": 2,
                "name": "CreativeCore",
                "description": "Дополнение к игре, необходимое для работы некоторых модов. Например, для LittleTiles.",
                "link": "https://minecraft-inside.ru/mods/14214-creativecore.html"
            },
            {
                "id": 3,
                "name": "GeckoLib",
                "description": "Движок прямой кинематики для Minecraft, он позволяет переносить анимации в игру и использовать их в автоматическом режиме. С помощью GeckoLib можно экспортировать анимации из Blockbench и применять их к объектам в игровом мире.",
                "link": "https://minecraft-inside.ru/mods/146483-geckolib.html"
            },
            {
                "id": 4,
                "name": "Cloth Config API",
                "description": "Библиотека, позволяющая другим майнкрафт модам использовать API для работы с интерфейсом настроек.",
                "link": "https://minecraft-inside.ru/mods/146382-cloth-config-api.html"
            },
            {
                "id": 5,
                "name": "iChunUtil",
                "description": "iChun Util  это дополнение к игре, необходимое для работы некоторых модов.",
                "link": "https://minecraft-inside.ru/mods/9092-ichun-util-mod.html"
            },
            {
                "id": 6,
                "name": "Curios API",
                "description": "С этим модом в интерфейсе игрока появятся дополнительные слоты, в которые можно положить различные аксессуары, как декоративные так и расширяющие возможности игрока. Curios не добавляет никаких аксессуаров, он только дает возможность другим модам пользоваться новыми слотами.",
                "link": "https://minecraft-inside.ru/mods/118398-curios-api.html"
            },
            {
                "id": 7,
                "name": "Blueprint (Abnormals Core)",
                "description": "Мод-ядро содержащий код, необходимый для работы модификаций от команды Abnormals.",
                "link": "https://minecraft-inside.ru/mods/134627-abnormals-core.html"
            }
        ],
        
        "modific": [
            {
                "id": 0,
                "name": "xxxx",
                "description": "xxxx",
                "dependence": {
                    "libs_id": false,
                    "modific_id": false
                },
                "link": "xxxx"
            },
            {
                "id": 1,
                "name": "Just Enough Items (JEI)",
                "description": "Этот мод является аналогом NEI и TMI, с его помощью вы сможете получить игровые предметы и посмотреть рецепты предметов и блоков из майнкрафт.",
                "dependence": {
                    "libs_id": 1,
                    "modific_id": false
                },
                "link": "https://minecraft-inside.ru/mods/24358-just-enough-items.html"
            },
            {
                "id": 2,
                "name": "Hwyla",
                "description": "Мод является форком популярной модификации WAILA для новых версий майнкрафт. После установки при наведении на блок/моба появится всплывающее окно с его названием, к какому моду принадлежит и полезная информация о нем.",
                "dependence": {
                    "libs_id": false,
                    "modific_id": false
                },
                "link": "https://minecraft-inside.ru/mods/45372-hwyla.html"
            },
            {
                "id": 3,
                "name": "Waila Harvestability",
                "description": "Это дополнение добавит в подсказки Waila информацию о том, можно ли добыть блок, уровень добычи и какой инструмент будет эффективен при добыче.",
                "dependence": {
                    "libs_id": false,
                    "modific_id": 2
                },
                "link": "https://minecraft-inside.ru/mods/36377-waila-harvestability.html"
            },
            {
                "id": 4,
                "name": "Just Enough Resources",
                "description": "Этот аддон для Just Enough Items, даст вам полезную информацию  о дропах с мобов и растений, генерации руд, возможном луте в данжах.",
                "dependence": {
                    "libs_id": false,
                    "modific_id": 1
                },
                "link": "https://minecraft-inside.ru/mods/31664-just-enough-resources.html"
            },
            {
                "id": 5,
                "name": "Block Drops",
                "description": "Мод показывающий, что дропает (роняет) тот или иной блок или предмет в игре.",
                "dependence": {
                    "libs_id": false,
                    "modific_id": 1
                },
                "link": "https://ru-minecraft.ru/mody-minecraft/49977-block-drops.html"
            },
            {
                "id": 6,
                "name": "Just Enough Effect Descriptions",
                "description": "Дополнение для JEI которое реализует показ описания действия эффекта, в том числе то, которое наложено на игрока, а так же показывает какие предметы или зелья накладывают данный эффект.",
                "dependence": {
                    "libs_id": false,
                    "modific_id": 1
                },
                "link": "https://ru-minecraft.ru/mody-minecraft/70609-jeed.html"
            },
            {
                "id": 7,
                "name": "OptiFine HD",
                "description": "OptiFine HD - мод для тонкой настройки графики в minecraft. После его установки в графических настройках игры появится новый интерфейс с большим количеством самых разных элементов. С помощью оптифайн для майнкрафт  можно увеличить ФПС, настроить сглаживание, устаналивать динамические текстуры и текстуры высокого разрешения, так же он добавляет поддержку шейдеров, которые значительно меняют внешний вид игры.",
                "dependence": {
                    "libs_id": false,
                    "modific_id": false
                },
                "link": "https://minecraft-inside.ru/mods/8956-optifine-hd.html"
            }
        ]
    }
}
